<%@ page contentType="text/html; charset=UTF-8"%>
<h1>Работа с бд</h1>
<h2>JDBC</h2>
    <p>
        <strong>JDBC</strong> - Java DataBase Connectivity
        - технологія доступу до даних, аналогічно ADO , PDO , та іншим , мета
        якої є надання універсального інтерфейсу для різних типів СУБД та
        інших постачальників даних.

    </p>
    <p>
      Технологія базується на підключенні , передаванні команд до СУБД та отримання відповіді ( або помилки або даних) .
        Технічно вазємодію реалізують драйвери ( або конектори )
        Програмно бажано реалізовувати у вигляді сервсу, оскільки доступ до даних може знадобитись у різних частинах
        проєкту.

    </p>
